In [4]:
import pandas as pd
import numpy as np
from sklearn.tree import DecisionTreeClassifier
from sklearn.naive_bayes import GaussianNB
import matplotlib.pyplot as plt
from sklearn.preprocessing import LabelEncoder
from sklearn import metrics

In [6]:
df = pd.read_csv('data.csv')

In [7]:
df.head()

,CustID,Age,Gender,Country,Employed,Income,ItemsPurchased(monthly),ProductType,PaymentType,Mode
0,1,37.0,Male,USA,True,NaN,99.0,BabyCare,Cash,Offline
1,2,44.0,NaN,Russia,False,463034.0,21.0,BabyCare,Bank Transfer,NaN
2,3,900.0,Female,India,True,402865.0,31.0,Medical,UPI,Offline
3,4,46.0,NaN,USA,True,NaN,21.0,BabyCare,UPI,Offline
4,5,19.0,Female,Australia,True,221868.0,45.0,Medical,Bank Transfer,Online

In [8]:
df = df.drop(['CustID'],axis=1)

In [9]:
df.head()

,Age,Gender,Country,Employed,Income,ItemsPurchased(monthly),ProductType,PaymentType,Mode
0,37.0,Male,USA,True,NaN,99.0,BabyCare,Cash,Offline
1,44.0,NaN,Russia,False,463034.0,21.0,BabyCare,Bank Transfer,NaN
2,900.0,Female,India,True,402865.0,31.0,Medical,UPI,Offline
3,46.0,NaN,USA,True,NaN,21.0,BabyCare,UPI,Offline
4,19.0,Female,Australia,True,221868.0,45.0,Medical,Bank Transfer,Online

In [10]:
df.isnull().sum()

Age                        7
Gender                     8
Country                    4
Employed                   3
Income                     4
ItemsPurchased(monthly)    4
ProductType                4
PaymentType                3
Mode                       4
dtype: int64

In [11]:
df['Age'] = df['Age'].fillna(df['Age'].mean())

In [12]:
df.isnull().sum()

Age                        0
Gender                     8
Country                    4
Employed                   3
Income                     4
ItemsPurchased(monthly)    4
ProductType                4
PaymentType                3
Mode                       4
dtype: int64

In [17]:
for i in ['Gender','Country','ProductType','PaymentType','Mode']:
    df[i] = df[i].fillna(df[i].mode()[0])

In [18]:
df.head()

,Age,Gender,Country,Employed,Income,ItemsPurchased(monthly),ProductType,PaymentType,Mode
0,37.0,Male,USA,True,NaN,99.0,BabyCare,Cash,Offline
1,44.0,Male,Russia,False,463034.0,21.0,BabyCare,Bank Transfer,Online
2,900.0,Female,India,True,402865.0,31.0,Medical,UPI,Offline
3,46.0,Male,USA,True,NaN,21.0,BabyCare,UPI,Offline
4,19.0,Female,Australia,True,221868.0,45.0,Medical,Bank Transfer,Online

In [19]:
df.isnull().sum()

Age                        0
Gender                     0
Country                    0
Employed                   3
Income                     4
ItemsPurchased(monthly)    4
ProductType                0
PaymentType                0
Mode                       0
dtype: int64

In [20]:
df['Employed'] = df['Employed'].fillna(df['Employed'].mode()[0])
df['Income'] = df['Income'].fillna(df['Income'].mean())
df['ItemsPurchased(monthly)'] = df['ItemsPurchased(monthly)'].fillna(df['ItemsPurchased(monthly)'].mean())

In [22]:
df.head()

,Age,Gender,Country,Employed,Income,ItemsPurchased(monthly),ProductType,PaymentType,Mode
0,37.0,Male,USA,True,242613.630435,99.0,BabyCare,Cash,Offline
1,44.0,Male,Russia,False,463034.000000,21.0,BabyCare,Bank Transfer,Online
2,900.0,Female,India,True,402865.000000,31.0,Medical,UPI,Offline
3,46.0,Male,USA,True,242613.630435,21.0,BabyCare,UPI,Offline
4,19.0,Female,Australia,True,221868.000000,45.0,Medical,Bank Transfer,Online

In [25]:
df[['Gender','Country','Employed','ProductType','PaymentType','Mode']] = df[['Gender','Country','Employed','ProductType','PaymentType','Mode']].apply(LabelEncoder().fit_transform)

In [26]:
df.head()

,Age,Gender,Country,Employed,Income,ItemsPurchased(monthly),ProductType,PaymentType,Mode
0,37.0,1,4,1,242613.630435,99.0,1,1,0
1,44.0,1,1,0,463034.000000,21.0,1,0,1
2,900.0,0,3,1,402865.000000,31.0,4,2,0
3,46.0,1,4,1,242613.630435,21.0,1,2,0
4,19.0,0,2,1,221868.000000,45.0,4,0,1

In [40]:
# Decision Tree Classifier
from sklearn.model_selection import train_test_split
Y = df['Mode']
X = df[['Age','PaymentType','Income','ItemsPurchased(monthly)']]
X_train,X_test,Y_train,Y_test = train_test_split(X,Y,test_size=0.3)
df.head()

,Age,Gender,Country,Employed,Income,ItemsPurchased(monthly),ProductType,PaymentType,Mode
0,37.0,1,4,1,242613.630435,99.0,1,1,0
1,44.0,1,1,0,463034.000000,21.0,1,0,1
2,900.0,0,3,1,402865.000000,31.0,4,2,0
3,46.0,1,4,1,242613.630435,21.0,1,2,0
4,19.0,0,2,1,221868.000000,45.0,4,0,1

In [39]:
df.head()

,Age,Gender,Country,Employed,Income,ItemsPurchased(monthly),ProductType,PaymentType,Mode
0,37.0,1,4,1,242613.630435,99.0,1,1,0
1,44.0,1,1,0,463034.000000,21.0,1,0,1
2,900.0,0,3,1,402865.000000,31.0,4,2,0
3,46.0,1,4,1,242613.630435,21.0,1,2,0
4,19.0,0,2,1,221868.000000,45.0,4,0,1

In [30]:
X_train.shape

(35, 8)

In [31]:
X_test.shape

(15, 8)

In [41]:
clf1 = DecisionTreeClassifier()
clf1.fit(X_train,Y_train)
X_test_pred = clf1.predict(X_test)

In [42]:
X_test_pred_proba = clf1.predict_proba(X_test)

In [43]:
# metrics
from sklearn.metrics import classification_report,confusion_matrix

In [44]:
print(classification_report(Y_test,X_test_pred))

              precision    recall  f1-score   support

           0       0.25      0.40      0.31         5
           1       0.57      0.40      0.47        10

    accuracy                           0.40        15
   macro avg       0.41      0.40      0.39        15
weighted avg       0.46      0.40      0.42        15

In [45]:
print(confusion_matrix(Y_test,X_test_pred))

[[2 3]
 [6 4]]

In [60]:
cf2 = GaussianNB()
cf2.fit(X_train,Y_train)
x_test_pred = cf2.predict(X_test)
x_test_pred_proba = cf2.predict_proba(X_test)

In [58]:
print(classification_report(Y_test,x_test_pred))

              precision    recall  f1-score   support

           0       0.50      0.40      0.44         5
           1       0.73      0.80      0.76        10

    accuracy                           0.67        15
   macro avg       0.61      0.60      0.60        15
weighted avg       0.65      0.67      0.66        15

In [59]:
print(confusion_matrix(Y_test,x_test_pred,labels=[0, 1]))

[[2 3]
 [2 8]]

In [67]:
auc_score_1 = metrics.roc_auc_score(Y_test,X_test_pred_proba[:,1])
auc_score_2 = metrics.roc_auc_score(Y_test,x_test_pred_proba[:,1])

In [68]:
auc_score_1

0.39999999999999997